/*
 Task 1:
 Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
 */
using System.Reflection.Metadata.Ecma335;

Console.WriteLine("Task 1 Natural numbers in the range from N to 1:");
int ShowNaturalNumbers (int N)
{
    if (N == 1) return 1;
    Console.WriteLine();
    return
    return
}

Console.Write("Enter N: ");
int N = int.Parse(Console.ReadLine());
